---
kind: type
id: T:Autodesk.Revit.DB.Structure.StickElementProjectionY
source: html/140e1e06-2916-7a76-8f71-2ac5967ee9c7.htm
---
# Autodesk.Revit.DB.Structure.StickElementProjectionY

Presets for given Analytical Projection.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum StickElementProjectionY
```